app/views/groups/index.html.erb

                        <h3 class="orgtitle"><a href="/groups/<%= group.id %>"><%= group.name %></a></h3>
                        <p class="orgdetails">Members: <%= group.joins.length %></p>
---
SELECT "joins".* FROM "joins" WHERE "joins"."group_id" = $1  [["group_id", 4]]