app/views/groups/show.html.erb

            <h1><%= @group.name %></h1>
            <% unless @group.users_joined.include? @user %>
---
SELECT  1 AS one FROM "users" INNER JOIN "joins" ON "users"."id" = "joins"."user_id" WHERE "joins"."group_id" = $1 AND "users"."id" = $2 LIMIT $3  [["group_id", 5], ["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" INNER JOIN "joins" ON "users"."id" = "joins"."user_id" WHERE "joins"."group_id" = $1  [["group_id", 4]]

            <%else%>
            <h4>Created By: <%= @group.User.first_name %> <%= @group.User.last_name %></h4>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]