app/controllers/groups_controller.rb

  def index
    @user = User.find_by(id:session["user_id"])
    @groups = Group.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "groups".* FROM "groups"

  def show
    @group = Group.find_by(id: params[:groupid])
    @groups = Group.all
    if @groups.include? @group
      @user = User.find_by(id: session["user_id"])
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "groups".* FROM "groups"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @user = User.find_by(id:session["user_id"])
    @group = Group.new(group_params)
    if @group.valid?
      puts "*******group*******"
      p @group
      @group.save
      @join = Join.new(User:@user, Group:@group)
      if @join.valid?
        @join.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "groups" ("name", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
INSERT INTO "joins" ("user_id", "group_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 3], ["group_id", 9], ["created_at", "2019-12-16 18:36:29.859908"], ["updated_at", "2019-12-16 18:36:29.859908"]]

  def destroy
    @user = User.find_by(id: session["user_id"])
    @group = Group.find_by(id:params[:groupid])
    @groups = Group.all
    if @groups.include? @group
      if @group.User.id == @user.id
        @group.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "groups".* FROM "groups"
DELETE FROM "groups" WHERE "groups"."id" = $1  [["id", 1]]