app/controllers/joins_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "groups".* FROM "groups"
SELECT  1 AS one FROM "groups" INNER JOIN "joins" ON "groups"."id" = "joins"."group_id" WHERE "joins"."user_id" = $1 AND "groups"."id" = $2 LIMIT $3  [["user_id", 5], ["id", 12], ["LIMIT", 1]]
INSERT INTO "joins" ("user_id", "group_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["group_id", 4], ["created_at", "2019-12-16 17:56:56.093659"], ["updated_at", "2019-12-16 17:56:56.093659"]]
---
    def create
        @user = User.find_by(id:session["user_id"])
        @group = Group.find_by(id: params[:groupid])
        @groups = Group.all
        if @groups.include? @group
            @join = Join.new(User: @user, Group: @group)
            if @join.valid?
                unless @user.groups_joined.include? @group
                    @join.save

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "groups".* FROM "groups"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "joins".* FROM "joins" WHERE "joins"."group_id" = $1 AND "joins"."user_id" = 1 LIMIT $2  [["group_id", 4], ["LIMIT", 1]]
DELETE FROM "joins" WHERE "joins"."id" = $1  [["id", 1]]
---
    def destroy
        @group = Group.find_by(id:params[:groupid])
        @groups = Group.all
        @user = User.find_by(id:session["user_id"])
        if @groups.include? @group
            @join = @group.joins.find_by(User: User.find_by(id:session["user_id"]))
            if @join
                unless @user.groups_joined.include? @group
                    flash[:notice] = "stop hacking"
                    redirect_to "/groups/" + @group.id.to_s
                else
                    @join.destroy