app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "jonsong94@yahoo.com"], ["LIMIT", 1]]
---
    def create
        puts "*******params*******"
        p params
        puts "*******params*******"
        puts params
        @user = User.find_by_email(params[:user][:email]).try(:authenticate, params[:user][:password])